# Basic Pandas Operations

In [0]:
# import numpy and pandas modules
import numpy as np
import pandas as pd

## Create Pandas Dataframe

In [36]:
# We will use a small dataset for a simple example data stored in a python dictionary 
data = {
    'Lion': [23, 17, 5, 12, 1, 5],
    'Tiger': [10, 7, 13, 2, 8, 19],
    'Leapord': [4, 14, 8, 15, 11, 3],
    'Cheetah': [4, 14, 8, 15, 11, 3]}
data

{'Cheetah': [4, 14, 8, 15, 11, 3],
 'Leapord': [4, 14, 8, 15, 11, 3],
 'Lion': [23, 17, 5, 12, 1, 5],
 'Tiger': [10, 7, 13, 2, 8, 19]}

In [37]:
# convert dictionary to a pandas dataframe notice that index numbers are serially generated
zoo = pd.DataFrame(data)
zoo

   Lion  Tiger  Leapord  Cheetah
0    23     10        4        4
1    17      7       14       14
2     5     13        8        8
3    12      2       15       15
4     1      8       11       11
5     5     19        3        3

In [38]:
# information about the dataframe
zoo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Lion     6 non-null      int64
 1   Tiger    6 non-null      int64
 2   Leapord  6 non-null      int64
 3   Cheetah  6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

In [39]:
# Take a look at the head of the dataframe
zoo.head(n=3)

   Lion  Tiger  Leapord  Cheetah
0    23     10        4        4
1    17      7       14       14
2     5     13        8        8

In [40]:
# Gives the last 5 values (tail of dataframe)
zoo.tail()

   Lion  Tiger  Leapord  Cheetah
1    17      7       14       14
2     5     13        8        8
3    12      2       15       15
4     1      8       11       11
5     5     19        3        3

In [41]:
# create a dataframe with index names specified data is the dataset in dictionary format index names are in a list format
idx_names = ['zoo0', 'zoo1', 'zoo2', 'zoo3', 'zoo4', 'zoo5']
zoo_indexname = pd.DataFrame(data, index = idx_names)
zoo_indexname

      Lion  Tiger  Leapord  Cheetah
zoo0    23     10        4        4
zoo1    17      7       14       14
zoo2     5     13        8        8
zoo3    12      2       15       15
zoo4     1      8       11       11
zoo5     5     19        3        3

## Working with Rows and Columns

In [42]:
# select row only by label, using loc[]  .loc refers to label
zoo_indexname.loc['zoo4']

Lion        1
Tiger       8
Leapord    11
Cheetah    11
Name: zoo4, dtype: int64

In [43]:
# select row and column, using loc[] .loc refers to label

zoo_indexname.loc['zoo3', 'Cheetah']

15

In [44]:
# slice by row, using index positions, python way

zoo_indexname[2:5]

      Lion  Tiger  Leapord  Cheetah
zoo2     5     13        8        8
zoo3    12      2       15       15
zoo4     1      8       11       11

In [45]:
# slice by row, using label names (values and not index position)

zoo_indexname['zoo2':'zoo5']

      Lion  Tiger  Leapord  Cheetah
zoo2     5     13        8        8
zoo3    12      2       15       15
zoo4     1      8       11       11
zoo5     5     19        3        3

In [46]:
# select column with slice method (all rows, and column at index position 1)  you will get back the Cheetah column, which is index position 1 column-wise
# i refers to index
zoo_indexname.iloc[:, 1]

zoo0    10
zoo1     7
zoo2    13
zoo3     2
zoo4     8
zoo5    19
Name: Tiger, dtype: int64

In [47]:
# select multiple rows and multiple columns with slice method  similar to pythonic way of indexing
zoo_indexname.iloc[2:5, 0:2]

      Lion  Tiger
zoo2     5     13
zoo3    12      2
zoo4     1      8

In [48]:
# select column using dot notation or bracket  zoo_indexname.Tiger

zoo_indexname['Lion']

zoo0    23
zoo1    17
zoo2     5
zoo3    12
zoo4     1
zoo5     5
Name: Lion, dtype: int64

In [49]:
# select multiple columns with brackets
zoo_indexname[['Lion', 'Tiger']]

      Lion  Tiger
zoo0    23     10
zoo1    17      7
zoo2     5     13
zoo3    12      2
zoo4     1      8
zoo5     5     19

In [50]:
# select column names
# no parentheses
zoo_indexname.columns

Index(['Lion', 'Tiger', 'Leapord', 'Cheetah'], dtype='object')

In [51]:
# sorting by values
zoo_indexname.sort_values(by='Lion')

      Lion  Tiger  Leapord  Cheetah
zoo4     1      8       11       11
zoo2     5     13        8        8
zoo5     5     19        3        3
zoo3    12      2       15       15
zoo1    17      7       14       14
zoo0    23     10        4        4

In [52]:
# summary statistics
zoo_indexname.describe()

           Lion      Tiger    Leapord    Cheetah
count   6.00000   6.000000   6.000000   6.000000
mean   10.50000   9.833333   9.166667   9.166667
std     8.38451   5.776389   5.036533   5.036533
min     1.00000   2.000000   3.000000   3.000000
25%     5.00000   7.250000   5.000000   5.000000
50%     8.50000   9.000000   9.500000   9.500000
75%    15.75000  12.250000  13.250000  13.250000
max    23.00000  19.000000  15.000000  15.000000

In [53]:
# transpose data (rows become columns and columns become rows)
zoo_indexname.T

         zoo0  zoo1  zoo2  zoo3  zoo4  zoo5
Lion       23    17     5    12     1     5
Tiger      10     7    13     2     8    19
Leapord     4    14     8    15    11     3
Cheetah     4    14     8    15    11     3

## Advanced Pandas Operations

In [0]:
# Demonstration of lambda, apply, map, filter, reduce, and groupby

In [56]:
# Let's see the dataframe again with zoo names
zoo_indexname

      Lion  Tiger  Leapord  Cheetah
zoo0    23     10        4        4
zoo1    17      7       14       14
zoo2     5     13        8        8
zoo3    12      2       15       15
zoo4     1      8       11       11
zoo5     5     19        3        3

In [57]:
# Use of apply and lambda
zoo_indexname['Tiger'] = zoo_indexname['Tiger'].apply(lambda x: x*17)
zoo_indexname['Cheetah'] = zoo_indexname['Cheetah'].apply(lambda x: x*8)
zoo_indexname['Lion'] = zoo_indexname['Lion'].apply(lambda x: x*23)
zoo_indexname

      Lion  Tiger  Leapord  Cheetah
zoo0   529    170        4       32
zoo1   391    119       14      112
zoo2   115    221        8       64
zoo3   276     34       15      120
zoo4    23    136       11       88
zoo5   115    323        3       24

In [58]:
# Use of apply and map
# Apply a function to a Dataframe elementwise.
zoo_indexname = zoo_indexname.applymap(lambda x: x/2.0)
zoo_indexname

       Lion  Tiger  Leapord  Cheetah
zoo0  264.5   85.0      2.0     16.0
zoo1  195.5   59.5      7.0     56.0
zoo2   57.5  110.5      4.0     32.0
zoo3  138.0   17.0      7.5     60.0
zoo4   11.5   68.0      5.5     44.0
zoo5   57.5  161.5      1.5     12.0

In [59]:
# Use of filter with brackets
# Where the condition is met, the actual value shows, otherwise NaN
# Where do we have values less than 50?
results_filter = zoo_indexname[zoo_indexname < 50]
results_filter

      Lion  Tiger  Leapord  Cheetah
zoo0   NaN    NaN      2.0     16.0
zoo1   NaN    NaN      7.0      NaN
zoo2   NaN    NaN      4.0     32.0
zoo3   NaN   17.0      7.5      NaN
zoo4  11.5    NaN      5.5     44.0
zoo5   NaN    NaN      1.5     12.0

In [67]:
# example of summation by column
Tiger_sum = zoo_indexname['Tiger'].sum()
Tiger_sum

501.5

In [68]:
# display dataframe again
zoo_indexname

       Lion  Tiger  Leapord  Cheetah
zoo0  264.5   85.0      2.0     16.0
zoo1  195.5   59.5      7.0     56.0
zoo2   57.5  110.5      4.0     32.0
zoo3  138.0   17.0      7.5     60.0
zoo4   11.5   68.0      5.5     44.0
zoo5   57.5  161.5      1.5     12.0

In [69]:
# Row-wise operation with axis = 0 for a Numpy array
# Reduce using apply and np.sum
# FutureWarning: The reduce argument is deprecated and will be removed in a future version.
#df_sum_column = zoo_indexname.apply(np.sum, reduce=True, axis=0)

# np.sum sums down the rows per column when we set axis = 0, 0 refers to the row axis for a NumPy array
# Row-wise operation
df_sum_column = zoo_indexname.apply(np.sum, axis=0)
df_sum_column

Lion       724.5
Tiger      501.5
Leapord     27.5
Cheetah    220.0
dtype: float64

In [70]:
# Column-wise operation with axis = 1 for a NumPy array
# You get back sum totals per row
df_sum_row = zoo_indexname.apply(np.sum, axis=1)
df_sum_row

zoo0    367.5
zoo1    318.0
zoo2    204.0
zoo3    222.5
zoo4    129.0
zoo5    232.5
dtype: float64

In [71]:
# Create a fourth column that has a list of boolean values
new_col = [True, True, False, True, False, False]

# Assign list to be the new column name
zoo_indexname['foster'] = new_col
zoo_indexname

       Lion  Tiger  Leapord  Cheetah  foster
zoo0  264.5   85.0      2.0     16.0    True
zoo1  195.5   59.5      7.0     56.0    True
zoo2   57.5  110.5      4.0     32.0   False
zoo3  138.0   17.0      7.5     60.0    True
zoo4   11.5   68.0      5.5     44.0   False
zoo5   57.5  161.5      1.5     12.0   False

In [72]:
# Use groupby and sum, aggregate functions
# You will attain the aggregate sums across zoos where False or True
zoo_indexname.groupby('foster').sum()

         Lion  Tiger  Leapord  Cheetah
foster
False   126.5  340.0     11.0     88.0
True    598.0  161.5     16.5    132.0

In [0]:
# end of section